## [D1022 과제, 김현우] <hr>

#### 판다스 자료구조 <hr>
    2-1 시리즈

In [59]:
import pandas as pd

In [60]:
# 예제 1-1) 딕셔너리 -> 시리즈 변환
dict_data = {'a':1, 'b':2, 'c':3}

sr_data = pd.Series(dict_data)

print(sr_data, type(sr_data))

idx = sr_data.index
print(idx)

a    1
b    2
c    3
dtype: int64 <class 'pandas.core.series.Series'>
Index(['a', 'b', 'c'], dtype='object')

In [61]:
# 예제 1-2) 시리즈 인덱스
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]

sr_data = pd.Series(list_data)
print(sr_data, type(sr_data))

idx = sr_data.index
print(idx)

val = sr_data.values
print(val)

print(sr_data.dtype)

print(len(sr_data))

print(sr_data.shape)

print(sr_data.ndim)

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object <class 'pandas.core.series.Series'>
RangeIndex(start=0, stop=5, step=1)
['2019-01-02' 3.14 'ABC' 100 True]
object
5
(5,)
1

In [62]:
# 예제 1-3) 시리즈 원소 선택
tup_data = ('영인', '2010-05-01', '여', True)

sr_data = pd.Series(tup_data,
                    index = ['이름', '생년월일', '성별', '학생여부'])

print(sr_data)

print(sr_data[0])
print(sr_data['이름'])

print(sr_data[[0, 1]])
print()
print(sr_data[['생년월일', '성별']])
print()
print(sr_data[:])
print()
print(sr_data['이름': '학생여부'])

pd.Series(5, index = ['a', 'b', 'c'])

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object
영인
영인
이름              영인
생년월일    2010-05-01
dtype: object

생년월일    2010-05-01
성별               여
dtype: object

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

C:\Users\khw27\AppData\Local\Temp\ipykernel_12180\1793692724.py:9: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr_data[0])
C:\Users\khw27\AppData\Local\Temp\ipykernel_12180\1793692724.py:12: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr_data[[0, 1]])

a    5
b    5
c    5
dtype: int64

    2-1 시리즈

In [63]:
# 예제 1-4) 딕셔너리 -> 데이터프레임 변환
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

df_data = pd.DataFrame(dict_data)

print(df_data, type(df_data))

df_data

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15 <class 'pandas.core.frame.DataFrame'>

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [64]:
# 예제 1-5) 행 인덱스/열 이름 설정
df = pd.DataFrame([[15,'남','덕영중'], [17,'여','수리중']],
                  index = ['준서','예은'],
                  columns = ['나이','성별','학교'])

print(df)

print(df.index)
print(df.columns)
print()
df.index = ['학생1', '학생2']
df.columns = ['연령','남녀','소속']
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중
Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [72]:
# 예제 1-6) 행 인덱스/열 이름 변경
df = pd.DataFrame([[15,'남','덕영중'], [17,'여','수리중']],
                  index = ['준서','예은'],
                  columns = ['나이','성별','학교'])

df = df.rename(columns = {'나이':'연령', '성별':'남녀', '학교':'소속'})
df

df = df.rename(index = {'준서':'학생1', '예은':'학생2'})
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [98]:
# 예제 1-7) 행 삭제
exam_data = {'수학':[90,80,70], '영어':[98,89,95],
             '음악':[85,95,100], '체육':[100,90,90]}

df = pd.DataFrame(exam_data, index = ['서준','우현','인아'])
print(df)

df2 = df.drop('우현')
print(df2)

df3 = df.copy()
df3 = df3.drop(['우현', '인아'], axis = 0)
print(df3)

df4 = df.copy()
df4 = df4.drop(index = ['우현'])
print(df4)

df5 = df.copy()
df5 = df5.drop(['우현', '인아'], axis = 'index')
print(df5)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90
    수학  영어  음악   체육
서준  90  98  85  100
    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90
    수학  영어  음악   체육
서준  90  98  85  100

In [118]:
# 예제 1-8) 열 삭제
exam_data = {'수학':[90,80,70], 
             '영어':[98,89,95], 
             '음악':[85,95,100], 
             '체육':[100,90,90]}

df = pd.DataFrame(exam_data, index = ['서준','우현','인아'])
print(df)

df2 = df.drop('수학', axis = 1)
print(df2)

df3 = df.drop(['수학', '영어'], axis = 1)
df3

df4 = df.drop(['수학', '영어'], axis = 'columns')
print(df4)

df5 = df.drop(columns = ['수학', '영어'])
print(df5)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90
     음악   체육
서준   85  100
우현   95   90
인아  100   90
     음악   체육
서준   85  100
우현   95   90
인아  100   90

In [131]:
# 예제 1-9) 행 선택
exam_data = {'수학':[90,80,70], 
             '영어':[98,89,95], 
             '음악':[85,95,100], 
             '체육':[100,90,90]}

df = pd.DataFrame(exam_data, index = ['서준', '우현', '민아'])

label1 = df.loc['서준']
position1 = df.iloc[0]

print(label1)
print()
print(position1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [133]:
label2 = df.loc[['서준', '우현']]
position2 = df.iloc[[0, 1]]

print(label2)
print()
print(position2)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [137]:
label3 = df.loc['서준':'우현']
position3 = df.iloc[0:1]

print(label3)
print()
print(position3)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

    수학  영어  음악   체육
서준  90  98  85  100

In [139]:
# 예제 10) 열 선택
exam_data = {'이름': ['서준','우현','인아'],
             '수학': [90,80,70],
             '영어': [98,89,95],
             '음악': [85,95,100],
             '체육': [100,90,90]}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [142]:
math1 = df['수학']
print(math1, type(math1))

0    90
1    80
2    70
Name: 수학, dtype: int64 <class 'pandas.core.series.Series'>

In [144]:
english1 = df.영어
print(english1, type(english1))

0    98
1    89
2    95
Name: 영어, dtype: int64 <class 'pandas.core.series.Series'>

In [148]:
music_gym = df[['영어', '체육']]
print(music_gym, type(music_gym))

   영어   체육
0  98  100
1  89   90
2  95   90 <class 'pandas.core.frame.DataFrame'>

In [153]:
# 예제 11) 원소 선택
exam_data = {'이름': ['서준','우현','인아'],
             '수학': [90,80,70],
             '영어': [98,89,95],
             '음악': [85,95,100],
             '체육': [100,90,90]}

df = pd.DataFrame(exam_data)
print(df)
df = df.set_index('이름')
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [157]:
a = df.loc['서준', '음악']
print(a)

b = df.iloc[0, 2]
print(b)

85
85

In [159]:
c = df.loc['서준', ['수학', '음악']]
print(c)

수학    90
음악    85
Name: 서준, dtype: int64

In [161]:
d = df.loc[['서준', '우현'], ['수학', '음악']]
print(d)

    수학  음악
이름
서준  90  85
우현  80  95

In [166]:
# 예제 1-12) 열 추가
exam_data = {'이름': ['서준','우현','인아'],
             '수학': [90,80,70],
             '영어': [98,89,95],
             '음악': [85,95,100],
             '체육': [100,90,90]}

df = pd.DataFrame(exam_data)
df

df['국어'] = 80
df

df['미술'] = [80, 90, 100]
df

   이름  수학  영어   음악   체육  국어   미술
0  서준  90  98   85  100  80   80
1  우현  80  89   95   90  80   90
2  인아  70  95  100   90  80  100

In [170]:
# 예제 1-13) 헹 추가
exam_data = {'이름': ['서준','우현','인아'],
             '수학': [90,80,70],
             '영어': [98,89,95],
             '음악': [85,95,100],
             '체육': [100,90,90]}

df = pd.DataFrame(exam_data)
df

df.loc[3] = 0
df

df.loc[4] = ['동규', 90, 80, 70, 60]
df

df.loc['행5'] = df.loc[3]
df

    이름  수학  영어   음악   체육
0   서준  90  98   85  100
1   우현  80  89   95   90
2   인아  70  95  100   90
3    0   0   0    0    0
4   동규  90  80   70   60
행5   0   0   0    0    0

In [191]:
# 예제 1-14) 원소 값 변경
exam_data = {'이름': ['서준','우현','인아'],
             '수학': [90,80,70],
             '영어': [98,89,95],
             '음악': [85,95,100],
             '체육': [100,90,90]}

df = pd.DataFrame(exam_data)
df = df.set_index('이름')
print(df)

df.iloc[0][3] = 80
print(df)

df.loc['서준']['체육'] = 70
print(df)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90
    수학  영어   음악  체육
이름
서준  90  98   85  70
우현  80  89   95  90
인아  70  95  100  90

C:\Users\khw27\AppData\Local\Temp\ipykernel_12180\1388005185.py:12: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.iloc[0][3] = 80
C:\Users\khw27\AppData\Local\Temp\ipykernel_12180\1388005185.py:12: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  df.iloc[0][3] = 80
C:\Users\khw27\AppData\Local\Temp\ipykernel_12180\1388005185.py:15: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.loc['서준']['체육'] = 70

In [194]:
# 예제 1-14) 원소 값 변경
df.loc['서준', ['음악', '체육']] = 80
print(df)

df.loc['서준', ['음악', '체육']] = 80, 70
print(df)

    수학  영어   음악  체육
이름
서준  90  98   80  80
우현  80  89   95  90
인아  70  95  100  90
    수학  영어   음악  체육
이름
서준  90  98   80  70
우현  80  89   95  90
인아  70  95  100  90

In [199]:
df = df.transpose()
print(df)
print()
df = df.T
print(df)

    수학  영어   음악  체육
이름
서준  90  98   80  70
우현  80  89   95  90
인아  70  95  100  90

이름  서준  우현   인아
수학  90  80   70
영어  98  89   95
음악  80  95  100
체육  70  90   90

#### 인덱스 활용 <hr>

In [215]:
# 예제 1-16) 특정 열을 행 인덱스로 설정
exam_data = {'이름': ['서준','우현','인아'],
            '수학': [90,80,70],
            '영어': [98,89,95],
            '음악': [85,95,100],
            '체육': [100,90,90]}

df = pd.DataFrame(exam_data)

ndf = df.set_index('이름')
ndf

ndf2 = df.set_index('수학')
ndf2

ndf3 = df.set_index(['수학', '영어'])
ndf3

       이름   음악   체육
수학 영어
90 98  서준   85  100
80 89  우현   95   90
70 95  인아  100   90

In [220]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index = ['r0', 'r1', 'r2'])
df

new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
ndf

ndf2 = df.reindex(new_index, fill_value = 0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [228]:
# 예제 1-18) 정수형 위치 인덱스 초기화

print(df)
ndf = df.reset_index(names = ['C00'])
ndf

ndf2 = df.reset_index(drop = True)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [238]:
# 예제 1-19) 데이터프레임 정렬
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}

df = pd.DataFrame(dict_data, index=['r0','r2','r1'])
print(df)

ndf = df.sort_index(ascending = False)
print(ndf)

ndf2 = df.sort_index(ascending = True)
print(ndf2)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r2   2   5   8  11  14
r1   3   6   9  12  15
    c0  c1  c2  c3  c4
r2   2   5   8  11  14
r1   3   6   9  12  15
r0   1   4   7  10  13
    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   3   6   9  12  15
r2   2   5   8  11  14

In [246]:
 # 예제 1-20) 열 기준 정렬
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,10,11],'c4':[15,14,14]}

df = pd.DataFrame(dict_data, index=['r0','r1','r2'])
print(df)
print()
ndf = df.sort_values(by='c1', ascending = False)
print(ndf)

ndf2 = df.sort_values(by = ['c3', 'c4'], ascending = [False, True])
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  15
r1   2   5   8  10  14
r2   3   6   9  11  14

    c0  c1  c2  c3  c4
r2   3   6   9  11  14
r1   2   5   8  10  14
r0   1   4   7  10  15

    c0  c1  c2  c3  c4
r2   3   6   9  11  14
r1   2   5   8  10  14
r0   1   4   7  10  15

#### 시리즈 연산 <hr>
    4-1 시리즈 vs 숫자

In [250]:
# 예제 1-21) 시리즈를 숫자로 나누기
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student1

percentage = student1 / 200
print(percentage)

국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [254]:
# 예제 1-22) 시리즈 사칙연산
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90, '영어':80})

addition = student1 + student2
print(addition, type(addition))

국어    190
수학    170
영어    160
dtype: int64 <class 'pandas.core.series.Series'>

In [269]:
substraction  = student1 - student2
print(substraction)

국어    10
수학    10
영어     0
dtype: int64

In [259]:
multiplication = student1 * student2         #곱셈
print(multiplication)

국어    9000
수학    7200
영어    6400
dtype: int64

In [261]:
division = student1 / student2               #나눗셈
print(division)

국어    1.111111
수학    1.125000
영어    1.000000
dtype: float64

In [271]:
result = pd.DataFrame([addition, substraction, multiplication, division],
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result)

              국어        수학      영어
덧셈     10.000000    10.000     0.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [276]:
# 예제 1-23) NaN 값이 있는 시리즈 연산
import pandas as pd
import numpy as np

student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})

print(student1)
print(student2)

addition = student1 + student2               
subtraction = student1 - student2            
multiplication = student1 * student2         
division = student1 / student2         

result = pd.DataFrame([addition, subtraction, multiplication, division],
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result)

국어     NaN
영어    80.0
수학    90.0
dtype: float64
수학    80
국어    90
dtype: int64
     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

In [283]:
# 예제 1-23) 연산 메소드 사용 - 시리즈 연산
print(student2)
sr_add = student1.add(student2, fill_value=0)
sr_sub = student1.sub(student2, fill_value=0)
sr_mul = student1.mul(student2, fill_value=0)
sr_div = student1.div(student2, fill_value=0)

result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div],
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])

print(result)

수학    80
국어    90
dtype: int64
       국어        수학    영어
덧셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곱셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf

    4-1 시리즈 vs 숫자

In [ ]:
# 예제 1-25) 데이터프레임에 숫자 더하기